export const likertLabels: { [key: number]: string } = {
  1: "전혀 그렇지 않다",
  2: "대체로 그렇지 않다",
  3: "조금 그렇지 않다",
  4: "보통이다",
  5: "조금 그렇다",
  6: "대체로 그렇다",
  7: "매우 그렇다",
};

export const likertLabels5: { [key: number]: string } = {
  1: "전혀 그렇지 않다",
  2: "그렇지 않다",
  3: "보통이다",
  4: "그렇다",
  5: "매우 그렇다",
};
export const attachmentQuestions = [
  {
    id: "B01",
    text: "나는 필요할 때 상대방에게 의지하는 것이 도움이 된다.",
  },
  {
    id: "B02",
    text: "나는 상대방에게서 내가 사랑받고 있다는 확신을 자주 필요로 한다.",
  },
  {
    id: "B03",
    text: "나는 상대방과 가까워지고 싶지만, 스스로 거리를 두곤 한다.",
  },
  {
    id: "B04",
    text: "나는 상대방이 내가 원하는 만큼 가까워지려 하지 않는다고 느낀다.",
  },
  {
    id: "B05",
    text: "나는 위로나 안심을 포함해 많은 것을 상대방에게 의지한다.",
  },
  {
    id: "B06",
    text: "내가 너무 가까워지려는 욕구가 때때로 상대방을 멀어지게 만든다.",
  },
  {
    id: "B07",
    text: "나는 상대방과 지나치게 가까워지는 것을 피하려 한다.",
  },
  { id: "B08", text: "나는 버림받을 것에 대해 자주 걱정하지 않는다." },
  { id: "B09", text: "나는 내 문제와 걱정을 보통 상대방과 이야기한다." },
  {
    id: "B10",
    text: "내가 필요할 때 상대방이 곁에 없으면 답답함을 느낀다.",
  },
  {
    id: "B11",
    text: "나는 상대방이 나와 지나치게 가까워지는 것이 불안하다.",
  },
  {
    id: "B12",
    text: "나는 상대방이 나를 내가 그들을 생각하는 만큼 중요하게 여기지 않을까 걱정한다.",
  },
];
